3A/MATH213/PI-Zeros-Stability.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-03-17 Sun 01:55 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>PI Controllers, Zeros, Extra Poles, and Stability</title>
<meta name="author" content="Arnav Gupta" />
<meta name="generator" content="Org Mode" />

</head>
<body>
<div id="content" class="content">
<h1 class="title">PI Controllers, Zeros, Extra Poles, and Stability</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org914023f">1. PI Controller Analysis</a></li>
<li><a href="#orga0673de">2. Adding a Pole</a></li>
<li><a href="#orge99db0d">3. Stability</a></li>
</ul>
</div>
</div>
<div id="outline-container-org914023f" class="outline-2">
<h2 id="org914023f"><span class="section-number-2">1.</span> PI Controller Analysis</h2>
<div class="outline-text-2" id="text-1">
<p>
The transfer function of the response of a PI controller can be simplified to the form:
\[
H_{z}(s) = \frac{\omega^{2} \left( \frac{s}{\alpha \xi \omega} + 1 \right)}
{s^{2} + 2 \xi \omega s + \omega^{2}}
\]
</p>

<p>
By analyzing the response of a PI controller to the step function, this can be decomposed
into a standard 2nd order impulse response and a standard 2nd order step response.
</p>

<p>
Specifically, if \(\alpha \to \infty\), then it goes to the step response, and if
\(\alpha \to 0\), then it goes to \(\infty \cdot\) the impulse response.
</p>

<p>
Combining these effects can lead to using \(k_{i}\) to adjust the speed of the response
and using \(k_{p}\) to control the dampening of the oscillations.
</p>
</div>
</div>
<div id="outline-container-orga0673de" class="outline-2">
<h2 id="orga0673de"><span class="section-number-2">2.</span> Adding a Pole</h2>
<div class="outline-text-2" id="text-2">
<p>
By adding a pole at \(s = -\alpha \xi \omega\) to the transfer function of a system,
it can be decomposed into the linear combination of 1st and 2nd order systems.
</p>

<p>
For this, if \(\alpha \to 0\), then the impulse response looks like a standard 1st
order system.
If \(\alpha \to \infty\), then the impulse response looks like a standard 2nd order
system.
</p>

<p>
When a real pole or a complex-conjugate pair of poles are an order of magnitude
closer to the imaginary axis than all other poles, then they are dominant.
</p>
</div>
</div>
<div id="outline-container-orge99db0d" class="outline-2">
<h2 id="orge99db0d"><span class="section-number-2">3.</span> Stability</h2>
<div class="outline-text-2" id="text-3">
<p>
The impulse response of <b>all</b> linear time invariant systems is a linear combination
of the types of functions analyzed.
Further, since \(\{\delta(t - \tau) | \tau \in \mathbb{R}\}\) is a basis for the
set of all functions, the response of any LTI to any function \(f(t)\) can be written
as a convolution of \(f(t)\) with a linear combination of the types of functions
analyzed.
</p>

<p>
An LTI \(S\) is stable if \(S(\delta(t))\) decays to 0.
</p>

<p>
An LTI \(S\) is unstable if \(S(\delta(t))\) is unbounded.
</p>

<p>
An LTI \(S\) is marginally stable if \(S(\delta(t))\) is bounded but does not decay
to 0.
</p>

<p>
A transfer function is stable if the system it is a transfer function for is stable.
</p>

<p>
A transfer function is unstable if the system it is a transfer function for is
unstable.
</p>

<p>
A transfer function is marginally stable if the system it is a transfer function for
is marginally stable.
</p>

<p>
A transfer function is stable if all poles have a negative real part.
</p>

<p>
A transfer function is unstable if there is a pole with a positive real part or
there is a 2nd order pole that has real part 0.
</p>

<p>
A transfer function is marginally stable if there are no poles with postive real parts
or 2nd order poles with real part 0 and in addition at least order 1 pole with real
part 0.
</p>

<p>
An LTI \(S\) is bounded-input, bounded-output (BIBO) stable if \(S(f)\) is bounded for
all bounded functions \(f\).
</p>

<p>
An LTI system with a rational transfer function is BIBO stable if and only if its
transfer function is both stable and proper.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Arnav Gupta</p>
<p class="date">Created: 2024-03-17 Sun 01:55</p>
</div>
</body>
</html>
